{
    "@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies/$entity",
    "@odata.type": "#microsoft.graph.conditionalAccessPolicy",
    "@odata.id": "identity/conditionalAccess/policies(\u0027b9aaae9b-ce37-48da-8efd-fd736371acac\u0027)",
    "@odata.editLink": "identity/conditionalAccess/policies(\u0027b9aaae9b-ce37-48da-8efd-fd736371acac\u0027)",
    "id": "b9aaae9b-ce37-48da-8efd-fd736371acac",
    "templateId": null,
    "displayName": "CA008-Global-DataProtection-AllApps-iOS\u0026Android-Compliance-Require Compliance policy v1.0",
    "createdDateTime@odata.type": "#DateTimeOffset",
    "createdDateTime": "2024-10-14T15:38:25.9681687Z",
    "modifiedDateTime@odata.type": "#DateTimeOffset",
    "modifiedDateTime": "2024-11-02T21:45:24.7982341Z",
    "state@odata.type": "#microsoft.graph.conditionalAccessPolicyState",
    "state": "enabledForReportingButNotEnforced",
    "partialEnablementStrategy": null,
    "sessionControls": null,
    "conditions": {
        "@odata.type": "#microsoft.graph.conditionalAccessConditionSet",
        "userRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
        "userRiskLevels": [],
        "signInRiskLevels@odata.type": "#Collection(microsoft.graph.riskLevel)",
        "signInRiskLevels": [],
        "clientAppTypes@odata.type": "#Collection(microsoft.graph.conditionalAccessClientApp)",
        "clientAppTypes": [
            "all"
        ],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "@odata.type": "#microsoft.graph.conditionalAccessApplications",
            "includeApplications@odata.type": "#Collection(String)",
            "includeApplications": [
                "All"
            ],
            "excludeApplications@odata.type": "#Collection(String)",
            "excludeApplications": [],
            "includeUserActions@odata.type": "#Collection(String)",
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences@odata.type": "#Collection(String)",
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "@odata.type": "#microsoft.graph.conditionalAccessUsers",
            "includeUsers@odata.type": "#Collection(String)",
            "includeUsers": [
                "All"
            ],
            "excludeUsers@odata.type": "#Collection(String)",
            "excludeUsers": [],
            "includeGroups@odata.type": "#Collection(String)",
            "includeGroups": [],
            "excludeGroups@odata.type": "#Collection(String)",
            "excludeGroups": [
                "8e0c1172-b3b1-4592-91b8-854ed43ed8bf"
            ],
            "includeRoles@odata.type": "#Collection(String)",
            "includeRoles": [],
            "excludeRoles@odata.type": "#Collection(String)",
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "@odata.type": "#microsoft.graph.conditionalAccessPlatforms",
            "includePlatforms@odata.type": "#Collection(microsoft.graph.conditionalAccessDevicePlatform)",
            "includePlatforms": [
                "android",
                "iOS"
            ],
            "excludePlatforms@odata.type": "#Collection(microsoft.graph.conditionalAccessDevicePlatform)",
            "excludePlatforms": [
                "windows",
                "windowsPhone",
                "macOS",
                "linux"
            ]
        }
    },
    "grantControls": {
        "@odata.type": "#microsoft.graph.conditionalAccessGrantControls",
        "operator": "OR",
        "builtInControls@odata.type": "#Collection(microsoft.graph.conditionalAccessGrantControl)",
        "builtInControls": [
            "compliantDevice"
        ],
        "customAuthenticationFactors@odata.type": "#Collection(String)",
        "customAuthenticationFactors": [],
        "termsOfUse@odata.type": "#Collection(String)",
        "termsOfUse": [],
        "authenticationStrength@odata.context": "https://graph.microsoft.com/beta/$metadata#identity/conditionalAccess/policies(\u0027b9aaae9b-ce37-48da-8efd-fd736371acac\u0027)/grantControls/authenticationStrength/$entity",
        "authenticationStrength@odata.associationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027b9aaae9b-ce37-48da-8efd-fd736371acac\u0027)/grantControls/authenticationStrength/$ref",
        "authenticationStrength@odata.navigationLink": "https://graph.microsoft.com/beta/identity/conditionalAccess/policies(\u0027b9aaae9b-ce37-48da-8efd-fd736371acac\u0027)/grantControls/authenticationStrength",
        "authenticationStrength": null
    }
}