{
    "id": "b9aaae9b-ce37-48da-8efd-fd736371acac",
    "templateId": null,
    "displayName": "CA008-Global-DataProtection-AllApps-iOS\u0026Android-Compliance-Require Compliance policy v1.0",
    "createdDateTime": "2024-10-14T15:38:25.9681687Z",
    "modifiedDateTime": "2024-11-02T21:45:24.7982341Z",
    "state": "enabledForReportingButNotEnforced",
    "sessionControls": null,
    "conditions": {
        "userRiskLevels": [],
        "signInRiskLevels": [],
        "clientAppTypes": [
            "all"
        ],
        "locations": null,
        "times": null,
        "deviceStates": null,
        "devices": null,
        "clientApplications": null,
        "applications": {
            "includeApplications": [
                "All"
            ],
            "excludeApplications": [
                "0000000a-0000-0000-c000-000000000000",
                "d4ebce55-015a-49b5-a083-c84d1797ae8c"
            ],
            "includeUserActions": [],
            "includeAuthenticationContextClassReferences": [],
            "applicationFilter": null
        },
        "users": {
            "includeUsers": [
                "All"
            ],
            "excludeUsers": [],
            "includeGroups": [],
            "excludeGroups": [
                "8e0c1172-b3b1-4592-91b8-854ed43ed8bf"
            ],
            "includeRoles": [],
            "excludeRoles": [],
            "includeGuestsOrExternalUsers": null,
            "excludeGuestsOrExternalUsers": null
        },
        "platforms": {
            "includePlatforms": [
                "android",
                "iOS"
            ],
            "excludePlatforms": [
                "windows",
                "windowsPhone",
                "macOS",
                "linux"
            ]
        }
    },
    "grantControls": {
        "operator": "OR",
        "builtInControls": [
            "compliantDevice"
        ],
        "customAuthenticationFactors": [],
        "termsOfUse": [],
        "authenticationStrength": null
    }
}